app/controllers/profiles_controller.rb

SELECT  "parents".* FROM "parents" WHERE "parents"."id" = NULL LIMIT 1
---
  def new
    @parent = Parent.find(params[:user_id])

SELECT  "parents".* FROM "parents" WHERE "parents"."id" = NULL LIMIT 1
INSERT INTO "children" ("first_name", "last_name", "city", "state", "phone", "gender", "sexual_preference", "religion", "bio", "linkedin_url", "facebook_url", "pf_image_1", "pf_image_2", "pf_image_3", "pf_image_4", "pf_image_5", "parent_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19) RETURNING "id"
---
  def create
    @parent = Parent.find(params[:user_id])
    @child = @parent.children.new(profile_params)

    # upload profile image if provided
    Child::PF_IMAGE_INDEX.each do |pf_image_key|
      @child.save_profile_image(params[:child][pf_image_key], pf_image_key) if params[:child][pf_image_key]